// 1.- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.





// let a = ['a', 'b', 'c']


// for (i = 1; i < 4; i++){
//     a.push(i)
   
// }
// console.log(a)







// 2.Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1]







// let b = [1, 2, 3]

// b.reverse()
// console.log(b)








//3. - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6



// let c = [1, 2, 3]


// for (i = 4; i < 7; i++){
//     c.push(i)
   
// }

// for (i = 6; i > 3; i--){
//     c.unshift(i)
   
// }

// console.log(c)







// 4.- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].





// let d = [1, 2, 3, 4, 5]


// for (i = 0; i < 3; i++){
//     d.shift()
   
// }


// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].





// for (i = 0; i < 3; i++){
//     d.pop()
   
// }



// console.log(d)








// 5.- Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].




// let e = [1, 2, 3, 4, 5]

// e.splice(3, 3, 'a', 'b', 'c')

// console.log(e)




// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними







// let f = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]



//  for (i = 0;i < f.length; i++){
//         if (f[i] % 2 === 0){
//             console.log(f[i])
             
//         }
//     }


// 6. - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.




// let g = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

// let k = []


// for (i = 0; i < g.length; i++){
//     k[i] = g[i];
// }

// console.log(k)





// 7- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово



// let arr = [ 'a', 'b', 'c']

// let newArr = []
// for (i = 0; i < arr.length; i++){
//       newArr = newArr + arr[i]
//     }
//     console.log(newArr)




// let arr = [ 'a', 'b', 'c']
// let newArr = []
// let i = 0;
// while(i < arr.length){
//       newArr = newArr + arr[i]
//       i++
// }

//     console.log(newArr)





// let arr = [ 'a', 'b', 'c']
// let newArr = []

// for (let newArr2 of arr){
//     newArr = newArr + newArr2
// }


// console.log(newArr)








// 8.зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


// let arr = [2,17,13,6,22,31,45,66,100,-18]





// let i = 0

// while(i < arr.length){
//     if (arr[i]%2 === 1){
//       console.log('Не парные ' + arr[i])
      
//     }
//     i++
// }


// while(i < arr.length){
//     if (arr[i]%2 === 0){
//       console.log('Парные ' + arr[i])
      
//     }
//     i++
// }


// for (let i = 0;i < arr.length; i++){
//   if (arr[i]%2 === 1){
//           console.log('Не парные ' + arr[i])
          
//         }
// }

// for (let i = 0;i < arr.length; i++){
//   if (arr[i]%2 === 0){
//           console.log('Не парные ' + arr[i])
          
//         }
// }




// for (let i = 0;i < arr.length; i++){
//   if (2 === i%3){
//           arr[i] = 'okten'
          
//         }
// }

// console.log(arr)








// 8. вивести масив в зворотньому порядку.



let arr = [2,17,13,6,22,31,45,66,100,-18]


// let i = arr.length

// while(i > -1){
//     if (arr[i]%2 === 1){
//       console.log('Не парные ' + arr[i])
      
//     }
//     i--
// }


// while(i > -1){
//     if (arr[i]%2 === 0){
//       console.log('Парные ' + arr[i])
      
//     }
//     i--
// }


// for (let i = arr.length;i > -1; i--){
//   if (arr[i]%2 === 1){
//           console.log('Не парные ' + arr[i])
          
//         }
// }

// for (let i = arr.length;i > -1; i--){
//   if (arr[i]%2 === 0){
//           console.log('Не парные ' + arr[i])
          
//         }
// }




// for (let i = arr.length;i > -1; i--){        // Не получилось(
//   if (2 === i%3){
//           arr[i] = 'okten'
          
//         }
// }

// console.log(arr)











// 9. створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу


// arr2 = []


// for (i = 0; i < 100; i++){
//   if(i%2 === 0){
//     arr2.push(i)
//   }
// }

// console.log(arr2)

// for (i = 0; i < 100; i++){
//   if(i%2 === 1){
//     arr2.push(i)
//   }
// }

// console.log(arr2)





// 10. Створити пустий масив та :
// a. заповнити його 50 парними числами за допомоги циклу.    Пункт 9
// b. заповнити його 50 непарними числами за допомоги циклу.   Пункт 9
// c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

// arr2 = []


// for (i = 0; i < 20; i++){
//   arr2[i] = Math.floor(Math.random() * (733 - 8) +8)
// }

// console.log(arr2)



// 11.Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив



// arr2 = []


// for (i = 0; i < 20; i++){
//   num = Math.floor(Math.random() * (733 - 8) + 8)
//     if(i%3 === 2 && num%2 === 0){
//       console.log(num)
//       arr2.push(num)
      
      
//   }
// }



// console.log(arr2)



// 12. Вивести кожен елемент масиву, сусід справа якого є парним


// let arr3 = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ]

// for (i = 0;i < arr3.length; i++){
//   if (arr3[i +1]%2 === 0){
//     console.log(arr3[i])
//   }
// }





// 13.Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.


// let arr4 = [100,250,50,168,120,345,188]
// let sum = 0

// for(i = 0;i< arr4.length; i++){
//     sum += arr4[i]
// }


// let res = sum/arr4.length
// console.log(res)









// 14. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.






// arr2 = []


// for (i = 0; i < 20; i++){
//   num = Math.floor(Math.random() * (20 - 2) + 2)
    
      
//       arr2.push(num )
      
      
  
// }

// console.log(arr2)


// let arr3 =[]

// for (i = 0; i < arr2.length; i++){
  
//   arr3.push(arr2[i] * 5) 
// }

// console.log(arr3)




// 15. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.

// let someArr = [true, 'hello', false, 55, 87, 'privet', 11]

// let someNewArr = []
// for(i = 0;i < someArr.length; i++){
//   if (typeof someArr[i] === 'number'){
//     console.log(someArr[i])
//     someNewArr.push(someArr[i])
//   }
// }

// console.log(someNewArr)




