// 1.- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.





// let a = ['a', 'b', 'c']


// for (i = 1; i < 4; i++){
//     a.push(i)
   
// }
// console.log(a)







// 2.Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1]







// let b = [1, 2, 3]

// b.reverse()
// console.log(b)








//3. - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6



// let c = [1, 2, 3]


// for (i = 4; i < 7; i++){
//     c.push(i)
   
// }

// for (i = 6; i > 3; i--){
//     c.unshift(i)
   
// }

// console.log(c)







// 4.- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].





// let d = [1, 2, 3, 4, 5]


// for (i = 0; i < 3; i++){
//     d.shift()
   
// }


// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].





// for (i = 0; i < 3; i++){
//     d.pop()
   
// }



// console.log(d)








// 5.- Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].




// let e = [1, 2, 3, 4, 5]

// e.splice(3, 3, 'a', 'b', 'c')

// console.log(e)


// let f = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]



//  for (i = 0;i < f.length; i++){
//         if (f[i] % 2 === 0){
//             console.log(f[i])
             
//         }
//     }


// 6. - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.




// let g = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

// let k = []


// for (i = 0; i < g.length; i++){
//     k[i] = g[i];
// }

// console.log(k)





// 7- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово


let arr = [ 'a', 'b', 'c']


for (i = 0; i < arr.length; i++){
      arr[i] = arr.join('')
    }
    console.log(arr)
